wolaite2024/jlab-jh5003-dongle/inc/rtl87x3ep/io/rtl_can.h
/**
*********************************************************************************************************
*               Copyright(c) 2023, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl_can.h
* \brief    The header file of the peripheral CAN driver.
* \details  This file provides all CAN firmware functions.
* \author   chenjie jin
* \date     2023-10-17
* \version  v1.0
* *******************************************************************************************************
*/

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef _RTL_CAN_H_
#define _RTL_CAN_H_

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "rtl876x.h"
#include "rtl_can_def.h"

/** @addtogroup 87x3ep_CAN CAN
  * @brief Can driver module
  * @{
  */

/*============================================================================*
 *                          Private Macros
 *============================================================================*/
#define CAN_MESSAGE_BUFFER_MAX_CNT      16
#define CAN_MESSAGE_BUFFER_DEFAULT_LEN  20
#define CAN_MESSAGE_FIFO_START_ID       12
#define CAN_DEFAULT_ERR_WARN_TH         96
#define CAN_STAND_DATA_MAX_LEN          8
#define CAN_FD_DATA_MAX_LEN             64
#define CAN_STD_FRAME_ID_POS            18
#define CAN_EXT_FRAME_ID_POS            0
#define CAN_RAM_ACC_DATA_POS            11
#define CAN_STAND_FRAME_ID_MAX_VALUE    0x7FFUL
#define CAN_EXTEND_FRAME_ID_MAX_VALUE   0x3FFFFUL
#define CAN_FRAME_ID_MASK_MAX_VALUE     0x1FFFFFFFUL

/*============================================================================*
 *                         Register Defines
 *============================================================================*/


/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup 87x3ep_CAN_Exported_Constants CAN Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    CAN_DLC_BYTE CAN DLC BYTE
 * \{
 * \ingroup     CAN_Exported_Constants
 */
#define CAN_DLC_BYTES_0                         (0x0UL)
#define CAN_DLC_BYTES_1                         (0x1UL)
#define CAN_DLC_BYTES_2                         (0x2UL)
#define CAN_DLC_BYTES_3                         (0x3UL)
#define CAN_DLC_BYTES_4                         (0x4UL)
#define CAN_DLC_BYTES_5                         (0x5UL)
#define CAN_DLC_BYTES_6                         (0x6UL)
#define CAN_DLC_BYTES_7                         (0x7UL)
#define CAN_DLC_BYTES_8                         (0x8UL)
#define CAN_DLC_BYTES_12                        (0x9UL)
#define CAN_DLC_BYTES_16                        (0xAUL)
#define CAN_DLC_BYTES_20                        (0xBUL)
#define CAN_DLC_BYTES_24                        (0xCUL)
#define CAN_DLC_BYTES_32                        (0xDUL)
#define CAN_DLC_BYTES_48                        (0xEUL)
#define CAN_DLC_BYTES_64                        (0xFUL)

/** End of CAN_DLC_BYTE
  * \}
  */

/**
 * \defgroup    CAN_Interrupt_Definition CAN Interrupt Definition
 * \{
 * \ingroup     CAN_Exported_Constants
 */
#define CAN_RAM_MOVE_DONE_INT                       BIT5
#define CAN_BUS_OFF_INT                             BIT4
#define CAN_WAKE_UP_INT                             BIT3
#define CAN_ERROR_INT                               BIT2
#define CAN_RX_INT                                  BIT1
#define CAN_TX_INT                                  BIT0

/** End of CAN_Interrupt_Definition
  * \}
  */

#define IS_CAN_INT_CONFIG(CONFIG)     (((CONFIG) == CAN_RAM_MOVE_DONE_INT)  || \
                                       ((CONFIG) == CAN_BUS_OFF_INT)        || \
                                       ((CONFIG) == CAN_WAKE_UP_INT)        || \
                                       ((CONFIG) == CAN_ERROR_INT)          || \
                                       ((CONFIG) == CAN_RX_INT)             || \
                                       ((CONFIG) == CAN_TX_INT))

/**
 * \defgroup    CAN_Interrupt_Flag CAN Interrupt Flag
 * \{
 * \ingroup     CAN_Exported_Constants
 */
#define CAN_RAM_MOVE_DONE_INT_FLAG                  BIT5
#define CAN_BUS_OFF_INT_FLAG                        BIT4
#define CAN_WAKE_UP_INT_FLAG                        BIT3
#define CAN_ERROR_INT_FLAG                          BIT2
#define CAN_RX_INT_FLAG                             BIT1
#define CAN_TX_INT_FLAG                             BIT0

/** End of CAN_Interrupt_Flag
  * \}
  */

#define IS_CAN_INT_FLAG(FLAG)         (((CONFIG) == CAN_RAM_MOVE_DONE_INT_FLAG) || \
                                       ((CONFIG) == CAN_BUS_OFF_INT_FLAG)       || \
                                       ((CONFIG) == CAN_WAKE_UP_INT_FLAG)       || \
                                       ((CONFIG) == CAN_ERROR_INT_FLAG)         || \
                                       ((CONFIG) == CAN_RX_INT_FLAG)            || \
                                       ((CONFIG) == CAN_TX_INT_FLAG))

/**
 * \defgroup    CAN_ERROR_Mask CAN ERROR Mask
 * \{
 * \ingroup     CAN_Exported_Constants
 */
#define CAN_ERROR_RX                                BIT9
#define CAN_ERROR_TX                                BIT8
#define CAN_ERROR_ACK                               BIT5
#define CAN_ERROR_STUFF                             BIT4
#define CAN_ERROR_CRC                               BIT3
#define CAN_ERROR_FORM                              BIT2
#define CAN_ERROR_BIT1                              BIT1
#define CAN_ERROR_BIT0                              BIT0

/** End of CAN_ERROR_Mask
  * \}
  */

#define IS_CAN_ERROR_STATUS(STATUS)   (((STATUS) == CAN_ERROR_RX)   || \
                                       ((STATUS) == CAN_ERROR_TX)   || \
                                       ((STATUS) == CAN_ERROR_ACK)  || \
                                       ((STATUS) == CAN_ERROR_CRC)  || \
                                       ((STATUS) == CAN_ERROR_FORM) || \
                                       ((STATUS) == CAN_ERROR_BIT1) || \
                                       ((STATUS) == CAN_ERROR_BIT0))

/** End of 87x3ep_CAN_Exported_Constants
  * \}
  */

